Revit 2027 API
ExternalServiceId.Equality Operator
Compares two ExternalServiceId instances.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool operator ==(
	ExternalServiceId first,
	ExternalServiceId second
)
Public Shared Operator = (
	first As ExternalServiceId,
	second As ExternalServiceId
) As Boolean
public:
static bool operator ==(
	ExternalServiceId^ first,
	ExternalServiceId^ second
)
static let inline (=)
        first : ExternalServiceId *
        second : ExternalServiceId  : bool
Parameters
first ExternalServiceId
The first ExternalServiceId.
second ExternalServiceId
The second ExternalServiceId.
Return Value
Boolean
True if the inputs are identical, false if they are different.
See Also
Reference
ExternalServiceId Class
Autodesk.Revit.DB.ExternalService Namespace